scripts/UC_2_buyItem/result1/Iteration8/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>Olivia123</ns2:safePayUsername><ns2:safePayPassword>ff3a15816ed1f2e95e40ba125c242551300adb70</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886123456789012</ns2:cardNumber><ns2:expirationDate>052026</ns2:expirationDate><ns2:cvvNumber>871</ns2:cvvNumber><ns2:customerName>Olivia Miller</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>